Revit 2026 API

# FamilyTypeSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyTypeSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
FamilyTypeSetIterator()
```
```fsharp
new : unit -> FamilyTypeSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

FamilyTypeSetIterator Class

Autodesk.Revit.DB Namespace